[
  {
    "GameID": 20251118,
    "Date": 1763424000000,
    "Opponent": "South Effingham",
    "LocationType": "Home",
    "GameType": "Non-Region",
    "Result": "L",
    "TeamScore": 38,
    "OpponentScore": 51,
    "ResultMargin": -13,
    "Season": 2025,
    "IsComplete": "Yes",
    "RecapTitle": "Lions Girls Basketball Drops Season Opener to South Effingham, 51–38",
    "Recap": "In the season opener, the Lions showed defensive effort and balanced contributions but came up short in a 51–38 loss to South Effingham High School. \n\nValerie Ward led the Lions with 11 points and added eight rebounds, providing steady production in the paint and on the glass. Ward’s presence helped keep the Lions competitive throughout the contest. \n\nAvery Nein followed with 10 points, scoring from both inside and beyond the arc while adding two assists. Aubri Rutledge chipped in eight points, converting all four of her free-throw attempts, while also collecting five rebounds and three steals. \n\nThe Lions also received contributions from PJ Benson, who finished with seven points, a blocked shot, and three steals, while Coco Carnahan added two points and four rebounds in the frontcourt. \n\nDefensively, the Lions were active throughout the game, forcing turnovers and contesting shots. Rutledge, Grace Dare, and Benson combined for nine steals, while multiple players recorded deflections to disrupt South Effingham’s offensive flow. \n\nRebounding was a collective effort, led by Ward’s eight boards and Dare’s five rebounds, as the Lions worked to control possessions and set the tone early in the season. Dare and Nein also combined for four assists, helping facilitate the offense."
  },
  {
    "GameID": 20251120,
    "Date": 1763600400000,
    "Opponent": "St. Vincent's",
    "LocationType": "Home",
    "GameType": "Non-Region",
    "Result": "W",
    "TeamScore": 50,
    "OpponentScore": 49,
    "ResultMargin": 1,
    "Season": 2025,
    "IsComplete": "Yes",
    "RecapTitle": "Teamwide Contributions Lift Lions Against St. Vincent’s",
    "Recap": "The Lions leaned on balanced scoring, rebounding, and defensive activity in their matchup against St. Vincent’s, with multiple players contributing across the stat sheet. \n\nAubri Rutledge led the Lions with 19 points, attacking the basket throughout the game and converting seven free throws. Rutledge also added six rebounds and three steals, providing steady pressure on both ends of the floor. \n\nValerie Ward delivered another strong all-around performance, finishing with 11 points, a team-high 16 rebounds, and five assists. Ward controlled the glass at both ends and helped facilitate the offense while adding two steals. \n\nThe Lions received additional scoring from PJ Benson, who scored 11 points, knocking down a three-pointer and contributing two assists. Grace Dare added five points, while Maren Wrieden chipped in two points. \n\nDefensively, the Lions were active throughout the game, recording steals, deflections, and contested possessions. Rutledge and Ward combined for five steals, while Coco Carnahan added a blocked shot and seven rebounds, anchoring the interior. \n\nThe Lions also shared the ball effectively, with Ward and Avery Nein combining for eight assists, helping create scoring opportunities across the lineup and maintain offensive balance."
  },
  {
    "GameID": 20251121,
    "Date": 1763686800000,
    "Opponent": "Bradwell Institute",
    "LocationType": "Home",
    "GameType": "Non-Region",
    "Result": "L",
    "TeamScore": 16,
    "OpponentScore": 59,
    "ResultMargin": -43,
    "Season": 2025,
    "IsComplete": "Yes",
    "RecapTitle": "Lions Girls Basketball Falls to Bradwell Institute, 59–16",
    "Recap": "The Lions faced a challenging matchup against Bradwell Institute on the road, dropping a 59–16 decision despite continued defensive effort and multiple players contributing across the stat sheet. \n\nPJ Benson led the Lions in scoring with six points, connecting on two three-pointers while adding three rebounds. Benson provided spacing offensively and competed on the defensive end throughout the contest. \n\nAubri Rutledge finished with three points, all from the free-throw line, and contributed four rebounds, five steals, and a team-high four deflections, consistently applying pressure and disrupting passing lanes. \n\nValerie Ward added three points and pulled down seven rebounds, while also recording two assists and a blocked shot, anchoring the Lions on the glass against Bradwell’s size. \n\nThe Lions also received contributions from Zyona Edwards, who scored three points and added three blocked shots, and Coco Carnahan, who chipped in one point and three rebounds in the frontcourt. \n\nDefensively, the Lions continued to compete, recording steals, deflections, and contested possessions throughout the game as they worked to limit second-chance opportunities."
  },
  {
    "GameID": 20251125,
    "Date": 1764032400000,
    "Opponent": "May River",
    "LocationType": "Away",
    "GameType": "Non-Region",
    "Result": "W",
    "TeamScore": 46,
    "OpponentScore": 36,
    "ResultMargin": 10,
    "Season": 2025,
    "IsComplete": "Yes",
    "RecapTitle": "Lions Girls Basketball Defeats May River, 46–36",
    "Recap": "The Lions earned a hard-fought 46–36 victory over May River High School, relying on rebounding, defensive discipline, and balanced scoring contributions across the lineup. \n\nValerie Ward led the Lions with 16 points and a dominant presence on the glass, finishing with 13 rebounds. Ward also added two assists, providing steady leadership in the paint throughout the contest. \n\nPJ Benson added 10 points, knocking down a three-pointer and converting at the free-throw line, while also contributing two assists. Aubri Rutledge followed with nine points and four rebounds, attacking the basket and applying consistent pressure defensively. \n\nThe Lions received additional scoring from Maren Wrieden and Grace Dare, who each finished with four points, while Avery Nein added three points to round out the offensive effort. \n\nDefensively, the Lions held May River in check with disciplined positioning and contested possessions. Ward, Rutledge, and Dare combined to control the defensive glass, while multiple players contributed steals and deflections to disrupt May River’s offensive flow."
  },
  {
    "GameID": 20251202,
    "Date": 1764640800000,
    "Opponent": "Hilton Head High School",
    "LocationType": "Away",
    "GameType": "Non-Region",
    "Result": "W",
    "TeamScore": 49,
    "OpponentScore": 27,
    "ResultMargin": 22,
    "Season": 2025,
    "IsComplete": "Yes",
    "RecapTitle": "Lions Girls Basketball Defeats Hilton Head High School, 49–27",
    "Recap": "The Lions continued their strong defensive play, earning a 49–27 victory over Hilton Head High School by controlling the pace, forcing turnovers, and getting balanced scoring across the lineup. \n\nAubri Rutledge led the Lions with 18 points, adding five rebounds and a team-high seven steals. Rutledge was active on both ends of the floor, finishing with 12 deflections to help disrupt Hilton Head’s offense. \n\nCoco Carnahan added 10 points and six rebounds, providing steady production in the paint, while Valerie Ward finished with six points, seven rebounds, and two assists to support the Lions’ interior presence. \n\nMaren Wrieden chipped in nine points, knocking down a three-pointer and contributing defensively, while Grace Dare pulled down seven rebounds and recorded seven steals to fuel the Lions’ defensive pressure. \n\nDefensively, the Lions set the tone throughout the game, forcing turnovers and limiting second-chance opportunities. Multiple players recorded steals and deflections as the Lions maintained control from start to finish."
  },
  {
    "GameID": 20251203,
    "Date": 1764727200000,
    "Opponent": "Southeast Bulloch",
    "LocationType": "Away",
    "GameType": "Non-Region",
    "Result": "W",
    "TeamScore": 59,
    "OpponentScore": 11,
    "ResultMargin": 48,
    "Season": 2025,
    "IsComplete": "Yes",
    "RecapTitle": "Lions Girls Basketball Defeats Southeast Bulloch, 59–11",
    "Recap": "The Lions delivered a dominant defensive performance, earning a 59–11 victory over Southeast Bulloch High School by forcing turnovers, controlling the glass, and getting balanced scoring throughout the lineup. \n\nAubri Rutledge and Valerie Ward shared the scoring lead with 17 points apiece. Rutledge added five rebounds and four steals, while Ward contributed five assists, eight steals, and consistent pressure on both ends of the floor. \n\nCoco Carnahan added 12 points on efficient shooting, while also contributing on the boards. Zyona Edwards finished with five points, five rebounds, and three assists, providing steady frontcourt production. \n\nThe Lions were active defensively across the lineup. Ward finished with eight steals, while Rutledge recorded 10 deflections. Multiple players contributed deflections and contested possessions as the Lions limited Southeast Bulloch’s offensive opportunities. \n\nRebounding was a collective effort, led by Kate Jackson with seven rebounds, while several players pulled down five or more boards as the Lions controlled the tempo from start to finish."
  },

  {
    "GameID": 20251209,
    "Date": 1765245600000,
    "Opponent": "South Effingham",
    "LocationType": "Away",
    "GameType": "Non-Region",
    "Result": "L",
    "TeamScore": 30,
    "OpponentScore": 39,
    "ResultMargin": -9,
    "Season": 2025,
    "IsComplete": "Yes",
    "RecapTitle": "Lions Girls Basketball Falls to South Effingham, 39–30",
    "Recap": "The Lions battled throughout the night but came up short in a 39–30 loss to South Effingham High School, with defensive effort and rebounding keeping the game within reach. \n\nValerie Ward led the Lions with eight points and a strong presence on the glass, pulling down 13 rebounds. Ward also added an assist and a steal while anchoring the interior. \n\nAubri Rutledge finished with seven points and two assists, while continuing to apply defensive pressure. Maren Wrieden added seven points, contributing from the floor and at the free-throw line. \n\nAvery Nein scored five points, knocking down a three-pointer, while Coco Carnahan contributed three points and six rebounds to support the Lions’ effort inside. \n\nDefensively, the Lions worked to disrupt South Effingham’s rhythm, contesting shots and forcing difficult possessions. Multiple players contributed on the boards as the Lions stayed competitive throughout the contest."
  },
  {
    "GameID": 20251210,
    "Date": 1765332000000,
    "Opponent": "Southeast Bulloch",
    "LocationType": "Home",
    "GameType": "Non-Region",
    "Result": "W",
    "TeamScore": 84,
    "OpponentScore": 12,
    "ResultMargin": 72,
    "Season": 2025,
    "IsComplete": "Yes",
    "RecapTitle": "Lions Girls Basketball Defeats Southeast Bulloch, 84–12",
    "Recap": "The Lions put together a dominant all-around performance Tuesday night, defeating Southeast Bulloch High School 84–12 behind balanced scoring, defensive pressure, and efficient ball movement. \n\nAubri Rutledge led all scorers with 20 points, shooting efficiently from the floor and getting to the free-throw line eight times. Rutledge also added five rebounds, seven steals, and six deflections, consistently setting the tone on both ends of the floor. \n\nValerie Ward turned in one of the most complete performances of the night, finishing with 16 points, a team-high nine assists, and 11 rebounds for a double-double. Ward also contributed five steals, helping drive the Lions’ transition game and defensive pressure. \n\nThe Lions received additional scoring support from multiple players. Avery Nein scored 15 points, connecting on three three-pointers, while Coco Carnahan and Emma Taylor each added seven points. Maren Wrieden chipped in eight points, knocking down two shots from beyond the arc and contributing on the glass. \n\nDefensively, the Lions were disruptive throughout the contest, with multiple players recording steals and deflections. Rutledge, Ward, and Kate Jackson combined for 16 steals, while Carnahan and Wrieden each recorded a blocked shot to help limit Southeast Bulloch’s scoring opportunities. \n\nRebounding and ball movement were key factors in the Lions’ success. Ward led the team with 11 rebounds, while Carnahan added six and Wrieden pulled down seven. The Lions shared the ball effectively throughout the lineup, maintaining offensive balance from start to finish."
  },
  {
    "GameID": 20251212,
    "Date": 1765504800000,
    "Opponent": "Hilton Head Prep",
    "LocationType": "Home",
    "GameType": "Non-Region",
    "Result": "W",
    "TeamScore": 45,
    "OpponentScore": 3,
    "ResultMargin": 42,
    "Season": 2025,
    "IsComplete": "Yes",
    "RecapTitle": "Lions Girls Basketball Defeats Hilton Head Prep, 45–3",
    "Recap": "The Lions delivered a dominant defensive performance Tuesday night, defeating Hilton Head Preparatory School 45–3 and holding them without a made field goal, as the visitors’ only points came at the free-throw line. \n\nFreshman Aubri Rutledge led the Lions with 12 points, while also contributing seven rebounds, four assists, and four steals. Rutledge was active on both ends of the floor, recording six deflections to help disrupt Hilton Head Prep’s offensive rhythm throughout the game. \n\nThe Lions received balanced scoring across the lineup. Senior Maren Wrieden finished with eight points, connecting on two three-pointers and drawing six trips to the free-throw line. Avery Nein and Zyona Edwards each added six points, while Emma Taylor chipped in five points to round out the Lions’ offensive effort. \n\nDefense set the tone from start to finish. The Lions recorded 15 total steals and applied consistent ball pressure that limited clean looks and forced turnovers. Coco Carnahan anchored the interior defense with two blocked shots, helping eliminate second-chance opportunities. \n\nRebounding was a collective effort, led by Rutledge’s seven rebounds. Grace Dare pulled down five boards, and Lyleigh Bradshaw added four, as the Lions controlled the glass and dictated the pace of play. \n\nThe Lions also shared the ball effectively, with Rutledge and Dare each finishing with four assists, keeping the offense balanced and efficient throughout the contest."
  },
  {
    "GameID": 20251219,
    "Date": 1766113200000,
    "Opponent": "Episcopal School of Jacksonville",
    "LocationType": "Away",
    "GameType": "Non-Region",
    "Result": "L",
    "TeamScore": 43,
    "OpponentScore": 52,
    "ResultMargin": -9,
    "Season": 2025,
    "IsComplete": "Yes",
    "RecapTitle": "Lions Fall Short Against Episcopal in Christmas Classic",
    "Recap": "St. Andrew’s competed in an afternoon matchup today at 2:00 PM, coming up short in a 52–43 decision against Episcopal School of Jacksonville. \n\nThe Eagles’ size presented challenges throughout the game, but the Lions remained steady and within reach for much of the contest. Aubri Rutledge led St. Andrew’s with 19 points, along with 5 rebounds and 5 steals, providing consistent effort on both ends of the floor. \n\nValerie Ward contributed 8 points and 3 steals, while eighth grader Zyona Edwards added 12 points, continuing to gain valuable varsity experience. \n\nSt. Andrew’s showed composure and effort throughout the afternoon against a physical opponent, taking positives from the matchup moving forward."
  },
  {
    "GameID": 20251220,
    "Date": 1766199600000,
    "Opponent": "Effingham County",
    "LocationType": "Away",
    "GameType": "Non-Region",
    "Result": "Unknown",
    "TeamScore": null,
    "OpponentScore": null,
    "ResultMargin": null,
    "Season": 2025,
    "IsComplete": "No",
    "Recap": null
  },
  {
    "GameID": 20251227,
    "Date": 1766804400000,
    "Opponent": "TBA",
    "LocationType": "Away",
    "GameType": "Non-Region",
    "Result": "Unknown",
    "TeamScore": null,
    "OpponentScore": null,
    "ResultMargin": null,
    "Season": 2025,
    "IsComplete": "No",
    "Recap": null
  },
  {
    "GameID": 20251229,
    "Date": 1766977200000,
    "Opponent": "Burke",
    "LocationType": "Away",
    "GameType": "Non-Region",
    "Result": "Unknown",
    "TeamScore": null,
    "OpponentScore": null,
    "ResultMargin": null,
    "Season": 2025,
    "IsComplete": "No",
    "Recap": null
  },
  {
    "GameID": 20251230,
    "Date": 1767063600000,
    "Opponent": "TBA",
    "LocationType": "Away",
    "GameType": "Non-Region",
    "Result": "Unknown",
    "TeamScore": null,
    "OpponentScore": null,
    "ResultMargin": null,
    "Season": 2025,
    "IsComplete": "No",
    "Recap": null
  },

  {
    "GameID": 20260107,
    "Date": 1767745200000,
    "Opponent": "John Paul II",
    "LocationType": "Home",
    "GameType": "Non-Region",
    "Result": "Unknown",
    "TeamScore": null,
    "OpponentScore": null,
    "ResultMargin": null,
    "Season": 2025,
    "IsComplete": "No",
    "Recap": null
  },
  {
    "GameID": 20260109,
    "Date": 1767918000000,
    "Opponent": "Pinewood Christian Academy",
    "LocationType": "Away",
    "GameType": "Region",
    "Result": "Unknown",
    "TeamScore": null,
    "OpponentScore": null,
    "ResultMargin": null,
    "Season": 2025,
    "IsComplete": "No",
    "Recap": null
  },
  {
    "GameID": 20260110,
    "Date": 1768004400000,
    "Opponent": "Woodville-Tompkins",
    "LocationType": "Away",
    "GameType": "Non-Region",
    "Result": "Unknown",
    "TeamScore": null,
    "OpponentScore": null,
    "ResultMargin": null,
    "Season": 2025,
    "IsComplete": "No",
    "Recap": null
  },
  {
    "GameID": 20260113,
    "Date": 1768263600000,
    "Opponent": "Frederica Academy",
    "LocationType": "Home",
    "GameType": "Region",
    "Result": "Unknown",
    "TeamScore": null,
    "OpponentScore": null,
    "ResultMargin": null,
    "Season": 2025,
    "IsComplete": "No",
    "Recap": null
  },
  {
    "GameID": 20260116,
    "Date": 1768522800000,
    "Opponent": "Westminster Schools of Augusta",
    "LocationType": "Away",
    "GameType": "Region",
    "Result": "Unknown",
    "TeamScore": null,
    "OpponentScore": null,
    "ResultMargin": null,
    "Season": 2025,
    "IsComplete": "No",
    "Recap": null
  },
  {
    "GameID": 20260120,
    "Date": 1768875600000,
    "Opponent": "Bulloch Academy",
    "LocationType": "Home",
    "GameType": "Region",
    "Result": "Unknown",
    "TeamScore": null,
    "OpponentScore": null,
    "ResultMargin": null,
    "Season": 2025,
    "IsComplete": "No",
    "Recap": null
  },
  {
    "GameID": 20260122,
    "Date": 1769048400000,
    "Opponent": "John Paul II",
    "LocationType": "Away",
    "GameType": "Non-Region",
    "Result": "Unknown",
    "TeamScore": null,
    "OpponentScore": null,
    "ResultMargin": null,
    "Season": 2025,
    "IsComplete": "No",
    "Recap": null
  },
  {
    "GameID": 20260127,
    "Date": 1769480400000,
    "Opponent": "Westminster Schools of Augusta",
    "LocationType": "Home",
    "GameType": "Region",
    "Result": "Unknown",
    "TeamScore": null,
    "OpponentScore": null,
    "ResultMargin": null,
    "Season": 2025,
    "IsComplete": "No",
    "Recap": null
  },
  {
    "GameID": 20260130,
    "Date": 1769739600000,
    "Opponent": "Pinewood Christian Academy",
    "LocationType": "Home",
    "GameType": "Region",
    "Result": "Unknown",
    "TeamScore": null,
    "OpponentScore": null,
    "ResultMargin": null,
    "Season": 2025,
    "IsComplete": "No",
    "Recap": null
  },
  {
    "GameID": 20260131,
    "Date": 1769826000000,
    "Opponent": "Bradwell Institute",
    "LocationType": "Away",
    "GameType": "Non-Region",
    "Result": "Unknown",
    "TeamScore": null,
    "OpponentScore": null,
    "ResultMargin": null,
    "Season": 2025,
    "IsComplete": "No",
    "Recap": null
  },
  {
    "GameID": 20260203,
    "Date": 1770085200000,
    "Opponent": "Frederica Academy",
    "LocationType": "Away",
    "GameType": "Region",
    "Result": "Unknown",
    "TeamScore": null,
    "OpponentScore": null,
    "ResultMargin": null,
    "Season": 2025,
    "IsComplete": "No",
    "Recap": null
  },
  {
    "GameID": 20260206,
    "Date": 1770344400000,
    "Opponent": "Bulloch Academy",
    "LocationType": "Away",
    "GameType": "Region",
    "Result": "Unknown",
    "TeamScore": null,
    "OpponentScore": null,
    "ResultMargin": null,
    "Season": 2025,
    "IsComplete": "No",
    "Recap": null
  }
]
